
globalNetConnect VDD -type pgpin -pin VDD -instanceBasename * -verbose
globalNetConnect VSS -type pgpin -pin VSS -instanceBasename * -verbose


# floorplan boundary
set ret [catch {floorplan -noResize -noSnapToGrid -b  0.0000000000 0.0000000000 556.0000000000 412.6800000000  0.0000000000 0.0000000000 556.0000000000 412.6800000000  8.0000000000 8.1700000000 548.0000000000 404.5100000000 }]
if {$ret != 0} {
  floorplan -noSnapToGrid -b  0.0000000000 0.0000000000 556.0000000000 412.6800000000  0.0000000000 0.0000000000 556.0000000000 412.6800000000  8.0000000000 8.1700000000 548.0000000000 404.5100000000 
}
# Standard Cell Row
deleteRow -all
set rdagFPlanRowSpaceType 2
set rdagFPlanRowSpacing 0
createRow -site CoreSite -area  8.0000000000 401.4700000000 548.0000000000 403.1800000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 399.7600000000 548.0000000000 401.4700000000  -noCheck
createRow -site CoreSite -area  8.0000000000 398.0500000000 548.0000000000 399.7600000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 396.3400000000 548.0000000000 398.0500000000  -noCheck
createRow -site CoreSite -area  8.0000000000 394.6300000000 548.0000000000 396.3400000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 392.9200000000 548.0000000000 394.6300000000  -noCheck
createRow -site CoreSite -area  8.0000000000 391.2100000000 548.0000000000 392.9200000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 389.5000000000 548.0000000000 391.2100000000  -noCheck
createRow -site CoreSite -area  8.0000000000 387.7900000000 548.0000000000 389.5000000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 386.0800000000 548.0000000000 387.7900000000  -noCheck
createRow -site CoreSite -area  8.0000000000 384.3700000000 548.0000000000 386.0800000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 382.6600000000 548.0000000000 384.3700000000  -noCheck
createRow -site CoreSite -area  8.0000000000 380.9500000000 548.0000000000 382.6600000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 379.2400000000 548.0000000000 380.9500000000  -noCheck
createRow -site CoreSite -area  8.0000000000 377.5300000000 548.0000000000 379.2400000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 375.8200000000 548.0000000000 377.5300000000  -noCheck
createRow -site CoreSite -area  8.0000000000 374.1100000000 548.0000000000 375.8200000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 372.4000000000 548.0000000000 374.1100000000  -noCheck
createRow -site CoreSite -area  8.0000000000 370.6900000000 548.0000000000 372.4000000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 368.9800000000 548.0000000000 370.6900000000  -noCheck
createRow -site CoreSite -area  8.0000000000 367.2700000000 548.0000000000 368.9800000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 365.5600000000 548.0000000000 367.2700000000  -noCheck
createRow -site CoreSite -area  8.0000000000 363.8500000000 548.0000000000 365.5600000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 362.1400000000 548.0000000000 363.8500000000  -noCheck
createRow -site CoreSite -area  8.0000000000 360.4300000000 548.0000000000 362.1400000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 358.7200000000 548.0000000000 360.4300000000  -noCheck
createRow -site CoreSite -area  8.0000000000 357.0100000000 548.0000000000 358.7200000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 355.3000000000 548.0000000000 357.0100000000  -noCheck
createRow -site CoreSite -area  8.0000000000 353.5900000000 548.0000000000 355.3000000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 351.8800000000 548.0000000000 353.5900000000  -noCheck
createRow -site CoreSite -area  8.0000000000 350.1700000000 548.0000000000 351.8800000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 348.4600000000 548.0000000000 350.1700000000  -noCheck
createRow -site CoreSite -area  8.0000000000 346.7500000000 548.0000000000 348.4600000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 345.0400000000 548.0000000000 346.7500000000  -noCheck
createRow -site CoreSite -area  8.0000000000 343.3300000000 548.0000000000 345.0400000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 341.6200000000 548.0000000000 343.3300000000  -noCheck
createRow -site CoreSite -area  8.0000000000 339.9100000000 548.0000000000 341.6200000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 338.2000000000 548.0000000000 339.9100000000  -noCheck
createRow -site CoreSite -area  8.0000000000 336.4900000000 548.0000000000 338.2000000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 334.7800000000 548.0000000000 336.4900000000  -noCheck
createRow -site CoreSite -area  8.0000000000 333.0700000000 548.0000000000 334.7800000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 331.3600000000 548.0000000000 333.0700000000  -noCheck
createRow -site CoreSite -area  8.0000000000 329.6500000000 548.0000000000 331.3600000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 327.9400000000 548.0000000000 329.6500000000  -noCheck
createRow -site CoreSite -area  8.0000000000 326.2300000000 548.0000000000 327.9400000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 324.5200000000 548.0000000000 326.2300000000  -noCheck
createRow -site CoreSite -area  8.0000000000 322.8100000000 548.0000000000 324.5200000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 321.1000000000 548.0000000000 322.8100000000  -noCheck
createRow -site CoreSite -area  8.0000000000 319.3900000000 548.0000000000 321.1000000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 317.6800000000 548.0000000000 319.3900000000  -noCheck
createRow -site CoreSite -area  8.0000000000 315.9700000000 548.0000000000 317.6800000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 314.2600000000 548.0000000000 315.9700000000  -noCheck
createRow -site CoreSite -area  8.0000000000 312.5500000000 548.0000000000 314.2600000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 310.8400000000 548.0000000000 312.5500000000  -noCheck
createRow -site CoreSite -area  8.0000000000 309.1300000000 548.0000000000 310.8400000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 307.4200000000 548.0000000000 309.1300000000  -noCheck
createRow -site CoreSite -area  8.0000000000 305.7100000000 548.0000000000 307.4200000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 304.0000000000 548.0000000000 305.7100000000  -noCheck
createRow -site CoreSite -area  8.0000000000 302.2900000000 548.0000000000 304.0000000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 300.5800000000 548.0000000000 302.2900000000  -noCheck
createRow -site CoreSite -area  8.0000000000 298.8700000000 548.0000000000 300.5800000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 297.1600000000 548.0000000000 298.8700000000  -noCheck
createRow -site CoreSite -area  8.0000000000 295.4500000000 548.0000000000 297.1600000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 293.7400000000 548.0000000000 295.4500000000  -noCheck
createRow -site CoreSite -area  8.0000000000 292.0300000000 548.0000000000 293.7400000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 290.3200000000 548.0000000000 292.0300000000  -noCheck
createRow -site CoreSite -area  8.0000000000 288.6100000000 548.0000000000 290.3200000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 286.9000000000 548.0000000000 288.6100000000  -noCheck
createRow -site CoreSite -area  8.0000000000 285.1900000000 548.0000000000 286.9000000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 283.4800000000 548.0000000000 285.1900000000  -noCheck
createRow -site CoreSite -area  8.0000000000 281.7700000000 548.0000000000 283.4800000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 280.0600000000 548.0000000000 281.7700000000  -noCheck
createRow -site CoreSite -area  8.0000000000 278.3500000000 548.0000000000 280.0600000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 276.6400000000 548.0000000000 278.3500000000  -noCheck
createRow -site CoreSite -area  8.0000000000 274.9300000000 548.0000000000 276.6400000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 273.2200000000 548.0000000000 274.9300000000  -noCheck
createRow -site CoreSite -area  8.0000000000 271.5100000000 548.0000000000 273.2200000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 269.8000000000 548.0000000000 271.5100000000  -noCheck
createRow -site CoreSite -area  8.0000000000 268.0900000000 548.0000000000 269.8000000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 266.3800000000 548.0000000000 268.0900000000  -noCheck
createRow -site CoreSite -area  8.0000000000 264.6700000000 548.0000000000 266.3800000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 262.9600000000 548.0000000000 264.6700000000  -noCheck
createRow -site CoreSite -area  8.0000000000 261.2500000000 548.0000000000 262.9600000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 259.5400000000 548.0000000000 261.2500000000  -noCheck
createRow -site CoreSite -area  8.0000000000 257.8300000000 548.0000000000 259.5400000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 256.1200000000 548.0000000000 257.8300000000  -noCheck
createRow -site CoreSite -area  8.0000000000 254.4100000000 548.0000000000 256.1200000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 252.7000000000 548.0000000000 254.4100000000  -noCheck
createRow -site CoreSite -area  8.0000000000 250.9900000000 548.0000000000 252.7000000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 249.2800000000 548.0000000000 250.9900000000  -noCheck
createRow -site CoreSite -area  8.0000000000 247.5700000000 548.0000000000 249.2800000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 245.8600000000 548.0000000000 247.5700000000  -noCheck
createRow -site CoreSite -area  8.0000000000 244.1500000000 548.0000000000 245.8600000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 242.4400000000 548.0000000000 244.1500000000  -noCheck
createRow -site CoreSite -area  8.0000000000 240.7300000000 548.0000000000 242.4400000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 239.0200000000 548.0000000000 240.7300000000  -noCheck
createRow -site CoreSite -area  8.0000000000 237.3100000000 548.0000000000 239.0200000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 235.6000000000 548.0000000000 237.3100000000  -noCheck
createRow -site CoreSite -area  8.0000000000 233.8900000000 548.0000000000 235.6000000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 232.1800000000 548.0000000000 233.8900000000  -noCheck
createRow -site CoreSite -area  8.0000000000 230.4700000000 548.0000000000 232.1800000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 228.7600000000 548.0000000000 230.4700000000  -noCheck
createRow -site CoreSite -area  8.0000000000 227.0500000000 548.0000000000 228.7600000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 225.3400000000 548.0000000000 227.0500000000  -noCheck
createRow -site CoreSite -area  8.0000000000 223.6300000000 548.0000000000 225.3400000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 221.9200000000 548.0000000000 223.6300000000  -noCheck
createRow -site CoreSite -area  8.0000000000 220.2100000000 548.0000000000 221.9200000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 218.5000000000 548.0000000000 220.2100000000  -noCheck
createRow -site CoreSite -area  8.0000000000 216.7900000000 548.0000000000 218.5000000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 215.0800000000 548.0000000000 216.7900000000  -noCheck
createRow -site CoreSite -area  8.0000000000 213.3700000000 548.0000000000 215.0800000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 211.6600000000 548.0000000000 213.3700000000  -noCheck
createRow -site CoreSite -area  8.0000000000 209.9500000000 548.0000000000 211.6600000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 208.2400000000 548.0000000000 209.9500000000  -noCheck
createRow -site CoreSite -area  8.0000000000 206.5300000000 548.0000000000 208.2400000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 204.8200000000 548.0000000000 206.5300000000  -noCheck
createRow -site CoreSite -area  8.0000000000 203.1100000000 548.0000000000 204.8200000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 201.4000000000 548.0000000000 203.1100000000  -noCheck
createRow -site CoreSite -area  8.0000000000 199.6900000000 548.0000000000 201.4000000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 197.9800000000 548.0000000000 199.6900000000  -noCheck
createRow -site CoreSite -area  8.0000000000 196.2700000000 548.0000000000 197.9800000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 194.5600000000 548.0000000000 196.2700000000  -noCheck
createRow -site CoreSite -area  8.0000000000 192.8500000000 548.0000000000 194.5600000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 191.1400000000 548.0000000000 192.8500000000  -noCheck
createRow -site CoreSite -area  8.0000000000 189.4300000000 548.0000000000 191.1400000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 187.7200000000 548.0000000000 189.4300000000  -noCheck
createRow -site CoreSite -area  8.0000000000 186.0100000000 548.0000000000 187.7200000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 184.3000000000 548.0000000000 186.0100000000  -noCheck
createRow -site CoreSite -area  8.0000000000 182.5900000000 548.0000000000 184.3000000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 180.8800000000 548.0000000000 182.5900000000  -noCheck
createRow -site CoreSite -area  8.0000000000 179.1700000000 548.0000000000 180.8800000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 177.4600000000 548.0000000000 179.1700000000  -noCheck
createRow -site CoreSite -area  8.0000000000 175.7500000000 548.0000000000 177.4600000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 174.0400000000 548.0000000000 175.7500000000  -noCheck
createRow -site CoreSite -area  8.0000000000 172.3300000000 548.0000000000 174.0400000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 170.6200000000 548.0000000000 172.3300000000  -noCheck
createRow -site CoreSite -area  8.0000000000 168.9100000000 548.0000000000 170.6200000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 167.2000000000 548.0000000000 168.9100000000  -noCheck
createRow -site CoreSite -area  8.0000000000 165.4900000000 548.0000000000 167.2000000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 163.7800000000 548.0000000000 165.4900000000  -noCheck
createRow -site CoreSite -area  8.0000000000 162.0700000000 548.0000000000 163.7800000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 160.3600000000 548.0000000000 162.0700000000  -noCheck
createRow -site CoreSite -area  8.0000000000 158.6500000000 548.0000000000 160.3600000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 156.9400000000 548.0000000000 158.6500000000  -noCheck
createRow -site CoreSite -area  8.0000000000 155.2300000000 548.0000000000 156.9400000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 153.5200000000 548.0000000000 155.2300000000  -noCheck
createRow -site CoreSite -area  8.0000000000 151.8100000000 548.0000000000 153.5200000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 150.1000000000 548.0000000000 151.8100000000  -noCheck
createRow -site CoreSite -area  8.0000000000 148.3900000000 548.0000000000 150.1000000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 146.6800000000 548.0000000000 148.3900000000  -noCheck
createRow -site CoreSite -area  8.0000000000 144.9700000000 548.0000000000 146.6800000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 143.2600000000 548.0000000000 144.9700000000  -noCheck
createRow -site CoreSite -area  8.0000000000 141.5500000000 548.0000000000 143.2600000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 139.8400000000 548.0000000000 141.5500000000  -noCheck
createRow -site CoreSite -area  8.0000000000 138.1300000000 548.0000000000 139.8400000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 136.4200000000 548.0000000000 138.1300000000  -noCheck
createRow -site CoreSite -area  8.0000000000 134.7100000000 548.0000000000 136.4200000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 133.0000000000 548.0000000000 134.7100000000  -noCheck
createRow -site CoreSite -area  8.0000000000 131.2900000000 548.0000000000 133.0000000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 129.5800000000 548.0000000000 131.2900000000  -noCheck
createRow -site CoreSite -area  8.0000000000 127.8700000000 548.0000000000 129.5800000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 126.1600000000 548.0000000000 127.8700000000  -noCheck
createRow -site CoreSite -area  8.0000000000 124.4500000000 548.0000000000 126.1600000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 122.7400000000 548.0000000000 124.4500000000  -noCheck
createRow -site CoreSite -area  8.0000000000 121.0300000000 548.0000000000 122.7400000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 119.3200000000 548.0000000000 121.0300000000  -noCheck
createRow -site CoreSite -area  8.0000000000 117.6100000000 548.0000000000 119.3200000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 115.9000000000 548.0000000000 117.6100000000  -noCheck
createRow -site CoreSite -area  8.0000000000 114.1900000000 548.0000000000 115.9000000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 112.4800000000 548.0000000000 114.1900000000  -noCheck
createRow -site CoreSite -area  8.0000000000 110.7700000000 548.0000000000 112.4800000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 109.0600000000 548.0000000000 110.7700000000  -noCheck
createRow -site CoreSite -area  8.0000000000 107.3500000000 548.0000000000 109.0600000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 105.6400000000 548.0000000000 107.3500000000  -noCheck
createRow -site CoreSite -area  8.0000000000 103.9300000000 548.0000000000 105.6400000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 102.2200000000 548.0000000000 103.9300000000  -noCheck
createRow -site CoreSite -area  8.0000000000 100.5100000000 548.0000000000 102.2200000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 98.8000000000 548.0000000000 100.5100000000  -noCheck
createRow -site CoreSite -area  8.0000000000 97.0900000000 548.0000000000 98.8000000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 95.3800000000 548.0000000000 97.0900000000  -noCheck
createRow -site CoreSite -area  8.0000000000 93.6700000000 548.0000000000 95.3800000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 91.9600000000 548.0000000000 93.6700000000  -noCheck
createRow -site CoreSite -area  8.0000000000 90.2500000000 548.0000000000 91.9600000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 88.5400000000 548.0000000000 90.2500000000  -noCheck
createRow -site CoreSite -area  8.0000000000 86.8300000000 548.0000000000 88.5400000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 85.1200000000 548.0000000000 86.8300000000  -noCheck
createRow -site CoreSite -area  8.0000000000 83.4100000000 548.0000000000 85.1200000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 81.7000000000 548.0000000000 83.4100000000  -noCheck
createRow -site CoreSite -area  8.0000000000 79.9900000000 548.0000000000 81.7000000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 78.2800000000 548.0000000000 79.9900000000  -noCheck
createRow -site CoreSite -area  8.0000000000 76.5700000000 548.0000000000 78.2800000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 74.8600000000 548.0000000000 76.5700000000  -noCheck
createRow -site CoreSite -area  8.0000000000 73.1500000000 548.0000000000 74.8600000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 71.4400000000 548.0000000000 73.1500000000  -noCheck
createRow -site CoreSite -area  8.0000000000 69.7300000000 548.0000000000 71.4400000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 68.0200000000 548.0000000000 69.7300000000  -noCheck
createRow -site CoreSite -area  8.0000000000 66.3100000000 548.0000000000 68.0200000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 64.6000000000 548.0000000000 66.3100000000  -noCheck
createRow -site CoreSite -area  8.0000000000 62.8900000000 548.0000000000 64.6000000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 61.1800000000 548.0000000000 62.8900000000  -noCheck
createRow -site CoreSite -area  8.0000000000 59.4700000000 548.0000000000 61.1800000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 57.7600000000 548.0000000000 59.4700000000  -noCheck
createRow -site CoreSite -area  8.0000000000 56.0500000000 548.0000000000 57.7600000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 54.3400000000 548.0000000000 56.0500000000  -noCheck
createRow -site CoreSite -area  8.0000000000 52.6300000000 548.0000000000 54.3400000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 50.9200000000 548.0000000000 52.6300000000  -noCheck
createRow -site CoreSite -area  8.0000000000 49.2100000000 548.0000000000 50.9200000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 47.5000000000 548.0000000000 49.2100000000  -noCheck
createRow -site CoreSite -area  8.0000000000 45.7900000000 548.0000000000 47.5000000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 44.0800000000 548.0000000000 45.7900000000  -noCheck
createRow -site CoreSite -area  8.0000000000 42.3700000000 548.0000000000 44.0800000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 40.6600000000 548.0000000000 42.3700000000  -noCheck
createRow -site CoreSite -area  8.0000000000 38.9500000000 548.0000000000 40.6600000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 37.2400000000 548.0000000000 38.9500000000  -noCheck
createRow -site CoreSite -area  8.0000000000 35.5300000000 548.0000000000 37.2400000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 33.8200000000 548.0000000000 35.5300000000  -noCheck
createRow -site CoreSite -area  8.0000000000 32.1100000000 548.0000000000 33.8200000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 30.4000000000 548.0000000000 32.1100000000  -noCheck
createRow -site CoreSite -area  8.0000000000 28.6900000000 548.0000000000 30.4000000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 26.9800000000 548.0000000000 28.6900000000  -noCheck
createRow -site CoreSite -area  8.0000000000 25.2700000000 548.0000000000 26.9800000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 23.5600000000 548.0000000000 25.2700000000  -noCheck
createRow -site CoreSite -area  8.0000000000 21.8500000000 548.0000000000 23.5600000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 20.1400000000 548.0000000000 21.8500000000  -noCheck
createRow -site CoreSite -area  8.0000000000 18.4300000000 548.0000000000 20.1400000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 16.7200000000 548.0000000000 18.4300000000  -noCheck
createRow -site CoreSite -area  8.0000000000 15.0100000000 548.0000000000 16.7200000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 13.3000000000 548.0000000000 15.0100000000  -noCheck
createRow -site CoreSite -area  8.0000000000 11.5900000000 548.0000000000 13.3000000000  -flip1st -noCheck
createRow -site CoreSite -area  8.0000000000 9.8800000000 548.0000000000 11.5900000000  -noCheck
createRow -site CoreSite -area  8.0000000000 8.1700000000 548.0000000000 9.8800000000  -flip1st -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 399.7600000000 548.0000000000 403.1800000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 396.3400000000 548.0000000000 399.7600000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 392.9200000000 548.0000000000 396.3400000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 389.5000000000 548.0000000000 392.9200000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 386.0800000000 548.0000000000 389.5000000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 382.6600000000 548.0000000000 386.0800000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 379.2400000000 548.0000000000 382.6600000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 375.8200000000 548.0000000000 379.2400000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 372.4000000000 548.0000000000 375.8200000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 368.9800000000 548.0000000000 372.4000000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 365.5600000000 548.0000000000 368.9800000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 362.1400000000 548.0000000000 365.5600000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 358.7200000000 548.0000000000 362.1400000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 355.3000000000 548.0000000000 358.7200000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 351.8800000000 548.0000000000 355.3000000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 348.4600000000 548.0000000000 351.8800000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 345.0400000000 548.0000000000 348.4600000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 341.6200000000 548.0000000000 345.0400000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 338.2000000000 548.0000000000 341.6200000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 334.7800000000 548.0000000000 338.2000000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 331.3600000000 548.0000000000 334.7800000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 327.9400000000 548.0000000000 331.3600000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 324.5200000000 548.0000000000 327.9400000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 321.1000000000 548.0000000000 324.5200000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 317.6800000000 548.0000000000 321.1000000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 314.2600000000 548.0000000000 317.6800000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 310.8400000000 548.0000000000 314.2600000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 307.4200000000 548.0000000000 310.8400000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 304.0000000000 548.0000000000 307.4200000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 300.5800000000 548.0000000000 304.0000000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 297.1600000000 548.0000000000 300.5800000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 293.7400000000 548.0000000000 297.1600000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 290.3200000000 548.0000000000 293.7400000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 286.9000000000 548.0000000000 290.3200000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 283.4800000000 548.0000000000 286.9000000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 280.0600000000 548.0000000000 283.4800000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 276.6400000000 548.0000000000 280.0600000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 273.2200000000 548.0000000000 276.6400000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 269.8000000000 548.0000000000 273.2200000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 266.3800000000 548.0000000000 269.8000000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 262.9600000000 548.0000000000 266.3800000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 259.5400000000 548.0000000000 262.9600000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 256.1200000000 548.0000000000 259.5400000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 252.7000000000 548.0000000000 256.1200000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 249.2800000000 548.0000000000 252.7000000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 245.8600000000 548.0000000000 249.2800000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 242.4400000000 548.0000000000 245.8600000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 239.0200000000 548.0000000000 242.4400000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 235.6000000000 548.0000000000 239.0200000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 232.1800000000 548.0000000000 235.6000000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 228.7600000000 548.0000000000 232.1800000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 225.3400000000 548.0000000000 228.7600000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 221.9200000000 548.0000000000 225.3400000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 218.5000000000 548.0000000000 221.9200000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 215.0800000000 548.0000000000 218.5000000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 211.6600000000 548.0000000000 215.0800000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 208.2400000000 548.0000000000 211.6600000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 204.8200000000 548.0000000000 208.2400000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 201.4000000000 548.0000000000 204.8200000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 197.9800000000 548.0000000000 201.4000000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 194.5600000000 548.0000000000 197.9800000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 191.1400000000 548.0000000000 194.5600000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 187.7200000000 548.0000000000 191.1400000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 184.3000000000 548.0000000000 187.7200000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 180.8800000000 548.0000000000 184.3000000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 177.4600000000 548.0000000000 180.8800000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 174.0400000000 548.0000000000 177.4600000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 170.6200000000 548.0000000000 174.0400000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 167.2000000000 548.0000000000 170.6200000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 163.7800000000 548.0000000000 167.2000000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 160.3600000000 548.0000000000 163.7800000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 156.9400000000 548.0000000000 160.3600000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 153.5200000000 548.0000000000 156.9400000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 150.1000000000 548.0000000000 153.5200000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 146.6800000000 548.0000000000 150.1000000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 143.2600000000 548.0000000000 146.6800000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 139.8400000000 548.0000000000 143.2600000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 136.4200000000 548.0000000000 139.8400000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 133.0000000000 548.0000000000 136.4200000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 129.5800000000 548.0000000000 133.0000000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 126.1600000000 548.0000000000 129.5800000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 122.7400000000 548.0000000000 126.1600000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 119.3200000000 548.0000000000 122.7400000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 115.9000000000 548.0000000000 119.3200000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 112.4800000000 548.0000000000 115.9000000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 109.0600000000 548.0000000000 112.4800000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 105.6400000000 548.0000000000 109.0600000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 102.2200000000 548.0000000000 105.6400000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 98.8000000000 548.0000000000 102.2200000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 95.3800000000 548.0000000000 98.8000000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 91.9600000000 548.0000000000 95.3800000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 88.5400000000 548.0000000000 91.9600000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 85.1200000000 548.0000000000 88.5400000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 81.7000000000 548.0000000000 85.1200000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 78.2800000000 548.0000000000 81.7000000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 74.8600000000 548.0000000000 78.2800000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 71.4400000000 548.0000000000 74.8600000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 68.0200000000 548.0000000000 71.4400000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 64.6000000000 548.0000000000 68.0200000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 61.1800000000 548.0000000000 64.6000000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 57.7600000000 548.0000000000 61.1800000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 54.3400000000 548.0000000000 57.7600000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 50.9200000000 548.0000000000 54.3400000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 47.5000000000 548.0000000000 50.9200000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 44.0800000000 548.0000000000 47.5000000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 40.6600000000 548.0000000000 44.0800000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 37.2400000000 548.0000000000 40.6600000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 33.8200000000 548.0000000000 37.2400000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 30.4000000000 548.0000000000 33.8200000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 26.9800000000 548.0000000000 30.4000000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 23.5600000000 548.0000000000 26.9800000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 20.1400000000 548.0000000000 23.5600000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 16.7200000000 548.0000000000 20.1400000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 13.3000000000 548.0000000000 16.7200000000  -noCheck
createRow -site CoreSiteDouble -area  8.0000000000 9.8800000000 548.0000000000 13.3000000000  -noCheck
fpSetDefaultTechSite -site CoreSite
# Placement obstruction
if {[get_db place_blockages] != ""} {
  deletePlaceBlockage -all
}
# Routing obstruction
set rblkgs [dbGet -e top.fplan.rblkgs {.attr != "core_eol" && .attr != "boundary_eol" && .attr != "block_eol"}]
if { $rblkgs != "" } { 
    dbSet $rblkgs.isFixed 0
}
deleteRouteBlk -all
setFPlanMode -cutOffRouteBlockageOutsideDie false
setFPlanMode -cutOffRouteBlockageOutsideDie true
# Pin blockage
deletePinBlkg -all
# Instance group
# Hierarchical Instance's constraint(Fence, Region or Guide)
unplaceGuide decoder1
createRegion  decoder1 396.2600000000 152.9600000000 453.8150000000 264.2300000000
unplaceGuide RegFileFF_blk.regbankff
createRegion  RegFileFF_blk.regbankff 398.6000000000 269.8000000000 542.0000000000 401.4700000000
unplaceGuide retire1
createRegion  retire1 237.8000000000 310.5400000000 273.8000000000 398.3100000000
unplaceGuide CSRBank1
createRegion  CSRBank1 277.6750000000 308.6850000000 393.6750000000 395.8950000000
unplaceGuide fetch1
createRegion  fetch1 396.3650000000 18.6800000000 451.1250000000 145.2400000000
unplaceGuide execute1
createRegion  execute1 457.5850000000 17.6000000000 541.2150000000 266.2850000000
unplaceGuide RAMFFT
createRegion  RAMFFT 235.4000000000 16.7200000000 390.6000000000 304.0000000000
unplaceGuide FFT_CORE
createRegion  FFT_CORE 13.4000000000 13.3000000000 228.8000000000 398.0500000000
# Pin
setPinAssignMode -pinEditInBatch true
editPin -pin clk -layer Metal2 -assign {0.0000000000 252.4150000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin reset_n -layer Metal1 -assign {534.7150000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin sys_reset_i -layer Metal1 -assign {550.6300000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin stall -layer Metal1 -assign {545.3250000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin instruction_i[31] -layer Metal1 -assign {258.6350000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin instruction_i[30] -layer Metal1 -assign {262.8800000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin instruction_i[29] -layer Metal1 -assign {267.1200000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin instruction_i[28] -layer Metal1 -assign {271.3700000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin instruction_i[27] -layer Metal1 -assign {275.6050000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin instruction_i[26] -layer Metal1 -assign {279.8500000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin instruction_i[25] -layer Metal1 -assign {284.1000000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin instruction_i[24] -layer Metal1 -assign {288.3400000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin instruction_i[23] -layer Metal1 -assign {292.5850000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin instruction_i[22] -layer Metal1 -assign {296.8300000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin instruction_i[21] -layer Metal1 -assign {301.0750000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin instruction_i[20] -layer Metal1 -assign {305.3150000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin instruction_i[19] -layer Metal1 -assign {309.5600000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin instruction_i[18] -layer Metal1 -assign {313.8000000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin instruction_i[17] -layer Metal1 -assign {318.0450000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin instruction_i[16] -layer Metal1 -assign {322.2850000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin instruction_i[15] -layer Metal1 -assign {326.5300000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin instruction_i[14] -layer Metal1 -assign {330.7750000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin instruction_i[13] -layer Metal1 -assign {335.0150000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin instruction_i[12] -layer Metal1 -assign {339.2550000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin instruction_i[11] -layer Metal1 -assign {343.5050000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin instruction_i[10] -layer Metal1 -assign {347.7500000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin instruction_i[9] -layer Metal1 -assign {351.9850000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin instruction_i[8] -layer Metal1 -assign {356.2350000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin instruction_i[7] -layer Metal1 -assign {360.4750000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin instruction_i[6] -layer Metal1 -assign {364.7200000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin instruction_i[5] -layer Metal1 -assign {368.9650000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin instruction_i[4] -layer Metal1 -assign {373.2100000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin instruction_i[3] -layer Metal1 -assign {377.4500000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin instruction_i[2] -layer Metal1 -assign {381.6950000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin instruction_i[1] -layer Metal1 -assign {385.9350000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin instruction_i[0] -layer Metal1 -assign {390.1800000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin mem_data_i[31] -layer Metal1 -assign {164.0950000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mem_data_i[30] -layer Metal1 -assign {158.7900000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mem_data_i[29] -layer Metal1 -assign {153.4850000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mem_data_i[28] -layer Metal1 -assign {148.1800000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mem_data_i[27] -layer Metal1 -assign {142.8750000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mem_data_i[26] -layer Metal1 -assign {137.7050000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mem_data_i[25] -layer Metal1 -assign {132.4050000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mem_data_i[24] -layer Metal1 -assign {127.1000000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mem_data_i[23] -layer Metal1 -assign {121.7950000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mem_data_i[22] -layer Metal1 -assign {116.4850000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mem_data_i[21] -layer Metal1 -assign {111.1800000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mem_data_i[20] -layer Metal1 -assign {105.8750000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mem_data_i[19] -layer Metal1 -assign {100.5750000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mem_data_i[18] -layer Metal1 -assign {95.2750000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mem_data_i[17] -layer Metal1 -assign {89.9700000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mem_data_i[16] -layer Metal1 -assign {84.6650000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mem_data_i[15] -layer Metal1 -assign {79.3600000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mem_data_i[14] -layer Metal1 -assign {74.0600000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mem_data_i[13] -layer Metal1 -assign {68.8850000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mem_data_i[12] -layer Metal1 -assign {63.5800000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mem_data_i[11] -layer Metal1 -assign {58.2800000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mem_data_i[10] -layer Metal1 -assign {52.9750000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mem_data_i[9] -layer Metal1 -assign {47.6700000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mem_data_i[8] -layer Metal1 -assign {42.3650000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mem_data_i[7] -layer Metal1 -assign {37.0600000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mem_data_i[6] -layer Metal1 -assign {31.7600000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mem_data_i[5] -layer Metal1 -assign {26.4550000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mem_data_i[4] -layer Metal1 -assign {21.1500000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mem_data_i[3] -layer Metal1 -assign {15.8400000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mem_data_i[2] -layer Metal1 -assign {10.5350000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mem_data_i[1] -layer Metal1 -assign {5.2300000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mem_data_i[0] -layer Metal1 -assign {0.3300000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mtime_i[63] -layer Metal1 -assign {529.4150000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mtime_i[62] -layer Metal1 -assign {524.1100000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mtime_i[61] -layer Metal1 -assign {518.8050000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mtime_i[60] -layer Metal1 -assign {513.5000000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mtime_i[59] -layer Metal1 -assign {508.1900000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mtime_i[58] -layer Metal1 -assign {502.8900000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mtime_i[57] -layer Metal1 -assign {497.5850000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mtime_i[56] -layer Metal1 -assign {492.2850000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mtime_i[55] -layer Metal1 -assign {486.9800000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mtime_i[54] -layer Metal1 -assign {481.8100000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mtime_i[53] -layer Metal1 -assign {476.5000000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mtime_i[52] -layer Metal1 -assign {471.1950000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mtime_i[51] -layer Metal1 -assign {465.8950000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mtime_i[50] -layer Metal1 -assign {460.5950000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mtime_i[49] -layer Metal1 -assign {455.2900000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mtime_i[48] -layer Metal1 -assign {449.9850000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mtime_i[47] -layer Metal1 -assign {444.6800000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mtime_i[46] -layer Metal1 -assign {439.3750000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mtime_i[45] -layer Metal1 -assign {434.0700000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mtime_i[44] -layer Metal1 -assign {428.7700000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mtime_i[43] -layer Metal1 -assign {423.4650000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mtime_i[42] -layer Metal1 -assign {418.1600000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mtime_i[41] -layer Metal1 -assign {412.9900000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mtime_i[40] -layer Metal1 -assign {407.6800000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mtime_i[39] -layer Metal1 -assign {402.3750000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mtime_i[38] -layer Metal1 -assign {397.0750000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mtime_i[37] -layer Metal1 -assign {391.7700000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mtime_i[36] -layer Metal1 -assign {386.4700000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mtime_i[35] -layer Metal1 -assign {381.1650000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mtime_i[34] -layer Metal1 -assign {375.8600000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mtime_i[33] -layer Metal1 -assign {370.5550000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mtime_i[32] -layer Metal1 -assign {365.2500000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mtime_i[31] -layer Metal1 -assign {359.9500000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mtime_i[30] -layer Metal1 -assign {354.6450000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mtime_i[29] -layer Metal1 -assign {349.3350000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mtime_i[28] -layer Metal1 -assign {344.1700000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mtime_i[27] -layer Metal1 -assign {338.8650000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mtime_i[26] -layer Metal1 -assign {333.5600000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mtime_i[25] -layer Metal1 -assign {328.2550000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mtime_i[24] -layer Metal1 -assign {322.9500000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mtime_i[23] -layer Metal1 -assign {317.6450000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mtime_i[22] -layer Metal1 -assign {312.3400000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mtime_i[21] -layer Metal1 -assign {307.0350000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mtime_i[20] -layer Metal1 -assign {301.7300000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mtime_i[19] -layer Metal1 -assign {296.4250000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mtime_i[18] -layer Metal1 -assign {291.1250000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mtime_i[17] -layer Metal1 -assign {285.8250000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mtime_i[16] -layer Metal1 -assign {280.5200000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mtime_i[15] -layer Metal1 -assign {275.3450000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mtime_i[14] -layer Metal1 -assign {270.0450000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mtime_i[13] -layer Metal1 -assign {264.7400000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mtime_i[12] -layer Metal1 -assign {259.4350000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mtime_i[11] -layer Metal1 -assign {254.1300000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mtime_i[10] -layer Metal1 -assign {248.8250000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mtime_i[9] -layer Metal1 -assign {243.5250000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mtime_i[8] -layer Metal1 -assign {238.2200000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mtime_i[7] -layer Metal1 -assign {232.9150000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mtime_i[6] -layer Metal1 -assign {227.6100000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mtime_i[5] -layer Metal1 -assign {222.3050000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mtime_i[4] -layer Metal1 -assign {217.0000000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mtime_i[3] -layer Metal1 -assign {211.6950000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mtime_i[2] -layer Metal1 -assign {206.5200000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mtime_i[1] -layer Metal1 -assign {201.2200000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mtime_i[0] -layer Metal1 -assign {195.9200000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin irq_i[31] -layer Metal1 -assign {122.8550000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin irq_i[30] -layer Metal1 -assign {127.1000000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin irq_i[29] -layer Metal1 -assign {131.3400000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin irq_i[28] -layer Metal1 -assign {135.5850000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin irq_i[27] -layer Metal1 -assign {139.8250000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin irq_i[26] -layer Metal1 -assign {144.0700000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin irq_i[25] -layer Metal1 -assign {148.3150000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin irq_i[24] -layer Metal1 -assign {152.5550000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin irq_i[23] -layer Metal1 -assign {156.8000000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin irq_i[22] -layer Metal1 -assign {161.0450000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin irq_i[21] -layer Metal1 -assign {165.2850000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin irq_i[20] -layer Metal1 -assign {169.5300000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin irq_i[19] -layer Metal1 -assign {173.7750000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin irq_i[18] -layer Metal1 -assign {178.0150000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin irq_i[17] -layer Metal1 -assign {182.2600000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin irq_i[16] -layer Metal1 -assign {186.5000000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin irq_i[15] -layer Metal1 -assign {190.7450000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin irq_i[14] -layer Metal1 -assign {194.9900000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin irq_i[13] -layer Metal1 -assign {199.2350000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin irq_i[12] -layer Metal1 -assign {203.4750000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin irq_i[11] -layer Metal1 -assign {207.7250000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin irq_i[10] -layer Metal1 -assign {211.9600000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin irq_i[9] -layer Metal1 -assign {216.2050000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin irq_i[8] -layer Metal1 -assign {220.4550000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin irq_i[7] -layer Metal1 -assign {224.6950000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin irq_i[6] -layer Metal1 -assign {228.9350000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin irq_i[5] -layer Metal1 -assign {233.1800000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin irq_i[4] -layer Metal1 -assign {237.4250000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin irq_i[3] -layer Metal1 -assign {241.6650000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin irq_i[2] -layer Metal1 -assign {245.9100000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin irq_i[1] -layer Metal1 -assign {250.1500000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin irq_i[0] -layer Metal1 -assign {254.3950000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin instruction_address_o[31] -layer Metal1 -assign {444.9450000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin instruction_address_o[30] -layer Metal1 -assign {448.5300000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin instruction_address_o[29] -layer Metal1 -assign {452.1050000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin instruction_address_o[28] -layer Metal1 -assign {455.6850000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin instruction_address_o[27] -layer Metal1 -assign {459.2650000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin instruction_address_o[26] -layer Metal1 -assign {462.8500000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin instruction_address_o[25] -layer Metal1 -assign {466.4250000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin instruction_address_o[24] -layer Metal1 -assign {470.0100000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin instruction_address_o[23] -layer Metal1 -assign {473.5900000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin instruction_address_o[22] -layer Metal1 -assign {477.1650000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin instruction_address_o[21] -layer Metal1 -assign {480.7500000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin instruction_address_o[20] -layer Metal1 -assign {484.3300000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin instruction_address_o[19] -layer Metal1 -assign {487.9050000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin instruction_address_o[18] -layer Metal1 -assign {491.4850000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin instruction_address_o[17] -layer Metal1 -assign {495.0700000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin instruction_address_o[16] -layer Metal1 -assign {498.6500000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin instruction_address_o[15] -layer Metal1 -assign {502.2300000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin instruction_address_o[14] -layer Metal1 -assign {505.8100000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin instruction_address_o[13] -layer Metal1 -assign {509.3900000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin instruction_address_o[12] -layer Metal1 -assign {512.9700000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin instruction_address_o[11] -layer Metal1 -assign {516.5500000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin instruction_address_o[10] -layer Metal1 -assign {520.1300000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin instruction_address_o[9] -layer Metal1 -assign {523.7100000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin instruction_address_o[8] -layer Metal1 -assign {527.2900000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin instruction_address_o[7] -layer Metal1 -assign {530.8700000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin instruction_address_o[6] -layer Metal1 -assign {534.4500000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin instruction_address_o[5] -layer Metal1 -assign {538.0250000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin instruction_address_o[4] -layer Metal1 -assign {541.6100000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin instruction_address_o[3] -layer Metal1 -assign {545.1900000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin instruction_address_o[2] -layer Metal1 -assign {548.7700000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin instruction_address_o[1] -layer Metal1 -assign {552.3500000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin instruction_address_o[0] -layer Metal1 -assign {556.0000000000 0.0950000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin mem_operation_enable_o -layer Metal1 -assign {169.4000000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mem_write_enable_o[3] -layer Metal1 -assign {190.6150000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mem_write_enable_o[2] -layer Metal1 -assign {185.3100000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mem_write_enable_o[1] -layer Metal1 -assign {180.0050000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mem_write_enable_o[0] -layer Metal1 -assign {174.7050000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin mem_address_o[31] -layer Metal1 -assign {556.0000000000 167.2950000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin mem_address_o[30] -layer Metal1 -assign {556.0000000000 172.4250000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin mem_address_o[29] -layer Metal1 -assign {556.0000000000 177.7450000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin mem_address_o[28] -layer Metal1 -assign {556.0000000000 183.0650000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin mem_address_o[27] -layer Metal1 -assign {556.0000000000 188.1950000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin mem_address_o[26] -layer Metal1 -assign {556.0000000000 193.3250000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin mem_address_o[25] -layer Metal1 -assign {556.0000000000 198.6450000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin mem_address_o[24] -layer Metal1 -assign {556.0000000000 203.7750000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin mem_address_o[23] -layer Metal1 -assign {556.0000000000 209.0950000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin mem_address_o[22] -layer Metal1 -assign {556.0000000000 214.2250000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin mem_address_o[21] -layer Metal1 -assign {556.0000000000 219.5450000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin mem_address_o[20] -layer Metal1 -assign {556.0000000000 224.6750000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin mem_address_o[19] -layer Metal1 -assign {556.0000000000 229.8050000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin mem_address_o[18] -layer Metal1 -assign {556.0000000000 235.1250000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin mem_address_o[17] -layer Metal1 -assign {556.0000000000 240.4450000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin mem_address_o[16] -layer Metal1 -assign {556.0000000000 245.5750000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin mem_address_o[15] -layer Metal1 -assign {556.0000000000 250.7050000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin mem_address_o[14] -layer Metal1 -assign {556.0000000000 256.0250000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin mem_address_o[13] -layer Metal1 -assign {556.0000000000 261.1550000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin mem_address_o[12] -layer Metal1 -assign {556.0000000000 266.4750000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin mem_address_o[11] -layer Metal1 -assign {556.0000000000 271.7950000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin mem_address_o[10] -layer Metal1 -assign {556.0000000000 276.9250000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin mem_address_o[9] -layer Metal1 -assign {556.0000000000 282.0550000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin mem_address_o[8] -layer Metal1 -assign {556.0000000000 287.3750000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin mem_address_o[7] -layer Metal1 -assign {556.0000000000 292.5050000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin mem_address_o[6] -layer Metal1 -assign {556.0000000000 297.8250000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin mem_address_o[5] -layer Metal1 -assign {556.0000000000 303.1450000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin mem_address_o[4] -layer Metal1 -assign {556.0000000000 308.2750000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin mem_address_o[3] -layer Metal1 -assign {556.0000000000 313.4050000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin mem_address_o[2] -layer Metal1 -assign {556.0000000000 318.7250000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin mem_address_o[1] -layer Metal1 -assign {556.0000000000 323.8550000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin mem_address_o[0] -layer Metal1 -assign {556.0000000000 329.1750000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin mem_data_o[31] -layer Metal1 -assign {556.0000000000 0.4750000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin mem_data_o[30] -layer Metal1 -assign {556.0000000000 5.4150000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin mem_data_o[29] -layer Metal1 -assign {556.0000000000 10.5450000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin mem_data_o[28] -layer Metal1 -assign {556.0000000000 15.6750000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin mem_data_o[27] -layer Metal1 -assign {556.0000000000 20.9950000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin mem_data_o[26] -layer Metal1 -assign {556.0000000000 26.3150000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin mem_data_o[25] -layer Metal1 -assign {556.0000000000 31.4450000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin mem_data_o[24] -layer Metal1 -assign {556.0000000000 36.7650000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin mem_data_o[23] -layer Metal1 -assign {556.0000000000 41.8950000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin mem_data_o[22] -layer Metal1 -assign {556.0000000000 47.0250000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin mem_data_o[21] -layer Metal1 -assign {556.0000000000 52.3450000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin mem_data_o[20] -layer Metal1 -assign {556.0000000000 57.6650000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin mem_data_o[19] -layer Metal1 -assign {556.0000000000 62.7950000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin mem_data_o[18] -layer Metal1 -assign {556.0000000000 68.1150000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin mem_data_o[17] -layer Metal1 -assign {556.0000000000 73.2450000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin mem_data_o[16] -layer Metal1 -assign {556.0000000000 78.3750000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin mem_data_o[15] -layer Metal1 -assign {556.0000000000 83.6950000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin mem_data_o[14] -layer Metal1 -assign {556.0000000000 89.0150000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin mem_data_o[13] -layer Metal1 -assign {556.0000000000 94.1450000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin mem_data_o[12] -layer Metal1 -assign {556.0000000000 99.2750000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin mem_data_o[11] -layer Metal1 -assign {556.0000000000 104.5950000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin mem_data_o[10] -layer Metal1 -assign {556.0000000000 109.7250000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin mem_data_o[9] -layer Metal1 -assign {556.0000000000 115.0450000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin mem_data_o[8] -layer Metal1 -assign {556.0000000000 120.3650000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin mem_data_o[7] -layer Metal1 -assign {556.0000000000 125.4950000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin mem_data_o[6] -layer Metal1 -assign {556.0000000000 130.6250000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin mem_data_o[5] -layer Metal1 -assign {556.0000000000 135.9450000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin mem_data_o[4] -layer Metal1 -assign {556.0000000000 141.0750000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin mem_data_o[3] -layer Metal1 -assign {556.0000000000 146.3950000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin mem_data_o[2] -layer Metal1 -assign {556.0000000000 151.7150000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin mem_data_o[1] -layer Metal1 -assign {556.0000000000 156.8450000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin mem_data_o[0] -layer Metal1 -assign {556.0000000000 161.9750000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin interrupt_ack_o -layer Metal2 -assign {0.0000000000 0.0950000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin rst -layer Metal1 -assign {540.0200000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin en_i -layer Metal2 -assign {0.0000000000 412.3950000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin we_i -layer Metal1 -assign {555.6700000000 412.6800000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side N -snap MGRID 
editPin -pin addr_i[15] -layer Metal2 -assign {0.0000000000 247.4750000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin addr_i[14] -layer Metal2 -assign {0.0000000000 242.7250000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin addr_i[13] -layer Metal2 -assign {0.0000000000 237.7850000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin addr_i[12] -layer Metal2 -assign {0.0000000000 232.8450000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin addr_i[11] -layer Metal2 -assign {0.0000000000 228.0950000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin addr_i[10] -layer Metal2 -assign {0.0000000000 223.1550000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin addr_i[9] -layer Metal2 -assign {0.0000000000 218.4050000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin addr_i[8] -layer Metal2 -assign {0.0000000000 213.4650000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin addr_i[7] -layer Metal2 -assign {0.0000000000 208.7150000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin addr_i[6] -layer Metal2 -assign {0.0000000000 203.7750000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin addr_i[5] -layer Metal2 -assign {0.0000000000 199.0250000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin addr_i[4] -layer Metal2 -assign {0.0000000000 194.0850000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin addr_i[3] -layer Metal2 -assign {0.0000000000 189.3350000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin addr_i[2] -layer Metal2 -assign {0.0000000000 184.3950000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin addr_i[1] -layer Metal2 -assign {0.0000000000 179.6450000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin addr_i[0] -layer Metal2 -assign {0.0000000000 174.7050000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin data_i[31] -layer Metal2 -assign {0.0000000000 407.6450000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin data_i[30] -layer Metal2 -assign {0.0000000000 402.7050000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin data_i[29] -layer Metal2 -assign {0.0000000000 397.9550000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin data_i[28] -layer Metal2 -assign {0.0000000000 393.0150000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin data_i[27] -layer Metal2 -assign {0.0000000000 388.2650000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin data_i[26] -layer Metal2 -assign {0.0000000000 383.3250000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin data_i[25] -layer Metal2 -assign {0.0000000000 378.5750000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin data_i[24] -layer Metal2 -assign {0.0000000000 373.6350000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin data_i[23] -layer Metal2 -assign {0.0000000000 368.8850000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin data_i[22] -layer Metal2 -assign {0.0000000000 363.9450000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin data_i[21] -layer Metal2 -assign {0.0000000000 359.1950000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin data_i[20] -layer Metal2 -assign {0.0000000000 354.2550000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin data_i[19] -layer Metal2 -assign {0.0000000000 349.3150000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin data_i[18] -layer Metal2 -assign {0.0000000000 344.5650000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin data_i[17] -layer Metal2 -assign {0.0000000000 339.6250000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin data_i[16] -layer Metal2 -assign {0.0000000000 334.8750000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin data_i[15] -layer Metal2 -assign {0.0000000000 329.9350000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin data_i[14] -layer Metal2 -assign {0.0000000000 325.1850000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin data_i[13] -layer Metal2 -assign {0.0000000000 320.2450000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin data_i[12] -layer Metal2 -assign {0.0000000000 315.4950000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin data_i[11] -layer Metal2 -assign {0.0000000000 310.5550000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin data_i[10] -layer Metal2 -assign {0.0000000000 305.8050000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin data_i[9] -layer Metal2 -assign {0.0000000000 300.8650000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin data_i[8] -layer Metal2 -assign {0.0000000000 296.1150000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin data_i[7] -layer Metal2 -assign {0.0000000000 291.1750000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin data_i[6] -layer Metal2 -assign {0.0000000000 286.2350000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin data_i[5] -layer Metal2 -assign {0.0000000000 281.4850000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin data_i[4] -layer Metal2 -assign {0.0000000000 276.5450000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin data_i[3] -layer Metal2 -assign {0.0000000000 271.7950000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin data_i[2] -layer Metal2 -assign {0.0000000000 266.8550000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin data_i[1] -layer Metal2 -assign {0.0000000000 262.1050000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin data_i[0] -layer Metal2 -assign {0.0000000000 257.1650000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin accel_out_en -layer Metal2 -assign {0.0000000000 169.7650000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin accel_dout_r[15] -layer Metal2 -assign {0.0000000000 77.6150000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin accel_dout_r[14] -layer Metal2 -assign {0.0000000000 72.8650000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin accel_dout_r[13] -layer Metal2 -assign {0.0000000000 67.9250000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin accel_dout_r[12] -layer Metal2 -assign {0.0000000000 63.1750000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin accel_dout_r[11] -layer Metal2 -assign {0.0000000000 58.2350000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin accel_dout_r[10] -layer Metal2 -assign {0.0000000000 53.2950000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin accel_dout_r[9] -layer Metal2 -assign {0.0000000000 48.5450000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin accel_dout_r[8] -layer Metal2 -assign {0.0000000000 43.6050000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin accel_dout_r[7] -layer Metal2 -assign {0.0000000000 38.8550000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin accel_dout_r[6] -layer Metal2 -assign {0.0000000000 33.9150000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin accel_dout_r[5] -layer Metal2 -assign {0.0000000000 29.1650000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin accel_dout_r[4] -layer Metal2 -assign {0.0000000000 24.2250000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin accel_dout_r[3] -layer Metal2 -assign {0.0000000000 19.4750000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin accel_dout_r[2] -layer Metal2 -assign {0.0000000000 14.5350000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin accel_dout_r[1] -layer Metal2 -assign {0.0000000000 9.7850000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin accel_dout_r[0] -layer Metal2 -assign {0.0000000000 4.8450000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin accel_dout_i[15] -layer Metal1 -assign {10.9400000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin accel_dout_i[14] -layer Metal1 -assign {14.1200000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin accel_dout_i[13] -layer Metal1 -assign {17.3000000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin accel_dout_i[12] -layer Metal1 -assign {20.4850000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin accel_dout_i[11] -layer Metal1 -assign {23.6700000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin accel_dout_i[10] -layer Metal1 -assign {26.8500000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin accel_dout_i[9] -layer Metal1 -assign {30.0300000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin accel_dout_i[8] -layer Metal1 -assign {33.2150000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin accel_dout_i[7] -layer Metal1 -assign {36.4000000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin accel_dout_i[6] -layer Metal1 -assign {39.5800000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin accel_dout_i[5] -layer Metal1 -assign {42.7600000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin accel_dout_i[4] -layer Metal1 -assign {45.9450000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin accel_dout_i[3] -layer Metal1 -assign {49.1250000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin accel_dout_i[2] -layer Metal1 -assign {52.3100000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin accel_dout_i[1] -layer Metal1 -assign {55.4900000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin accel_dout_i[0] -layer Metal1 -assign {58.6750000000 0.0000000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side S -snap MGRID 
editPin -pin accel_mem_en -layer Metal2 -assign {0.0000000000 165.0150000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin accel_mem_address[15] -layer Metal1 -assign {556.0000000000 334.4950000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin accel_mem_address[14] -layer Metal1 -assign {556.0000000000 339.6250000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin accel_mem_address[13] -layer Metal1 -assign {556.0000000000 344.7550000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin accel_mem_address[12] -layer Metal1 -assign {556.0000000000 350.0750000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin accel_mem_address[11] -layer Metal1 -assign {556.0000000000 355.2050000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin accel_mem_address[10] -layer Metal1 -assign {556.0000000000 360.5250000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin accel_mem_address[9] -layer Metal1 -assign {556.0000000000 365.8450000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin accel_mem_address[8] -layer Metal1 -assign {556.0000000000 370.7850000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin accel_mem_address[7] -layer Metal1 -assign {556.0000000000 376.1050000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin accel_mem_address[6] -layer Metal1 -assign {556.0000000000 381.4250000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin accel_mem_address[5] -layer Metal1 -assign {556.0000000000 386.5550000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin accel_mem_address[4] -layer Metal1 -assign {556.0000000000 391.8750000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin accel_mem_address[3] -layer Metal1 -assign {556.0000000000 397.0050000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin accel_mem_address[2] -layer Metal1 -assign {556.0000000000 402.1350000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin accel_mem_address[1] -layer Metal1 -assign {556.0000000000 407.4550000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin accel_mem_address[0] -layer Metal1 -assign {556.0000000000 412.5850000000} -pinWidth 0.06 -pinDepth 0.335 -fixOverlap false  -side E -snap MGRID 
editPin -pin accel_mem_data[15] -layer Metal2 -assign {0.0000000000 160.0750000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin accel_mem_data[14] -layer Metal2 -assign {0.0000000000 155.3250000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin accel_mem_data[13] -layer Metal2 -assign {0.0000000000 150.3850000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin accel_mem_data[12] -layer Metal2 -assign {0.0000000000 145.6350000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin accel_mem_data[11] -layer Metal2 -assign {0.0000000000 140.6950000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin accel_mem_data[10] -layer Metal2 -assign {0.0000000000 135.9450000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin accel_mem_data[9] -layer Metal2 -assign {0.0000000000 131.0050000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin accel_mem_data[8] -layer Metal2 -assign {0.0000000000 126.2550000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin accel_mem_data[7] -layer Metal2 -assign {0.0000000000 121.3150000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin accel_mem_data[6] -layer Metal2 -assign {0.0000000000 116.3750000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin accel_mem_data[5] -layer Metal2 -assign {0.0000000000 111.6250000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin accel_mem_data[4] -layer Metal2 -assign {0.0000000000 106.6850000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin accel_mem_data[3] -layer Metal2 -assign {0.0000000000 101.9350000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin accel_mem_data[2] -layer Metal2 -assign {0.0000000000 96.9950000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin accel_mem_data[1] -layer Metal2 -assign {0.0000000000 92.2450000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin accel_mem_data[0] -layer Metal2 -assign {0.0000000000 87.3050000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
editPin -pin accel_en -layer Metal2 -assign {0.0000000000 82.5550000000} -pinWidth 0.08 -pinDepth 0.25 -fixOverlap false  -side W -snap MGRID 
setPinAssignMode -pinEditInBatch false
# IO pad
# Area IO
# Bump
deleteBumps -all
# partition
# Block placement
unplaceAllBlocks
deleteHaloFromBlock -allBlock
# Global Net Connection
clearGlobalNets 
globalNetConnect VDD -pin {VDD} -instanceBasename * -type pgpin -all
globalNetConnect VSS -pin {VSS} -instanceBasename * -type pgpin -all
applyGlobalNets 
# busSinkGroup
# blackbox
# netGroupAndBusGuide
# relative floorplan
# pin groups
# pin guides
deletePinGuide -all
# custom shape
delete_gui_object -shape
# coverCell



globalNetConnect VDD -type pgpin -pin VDD -instanceBasename * -verbose
globalNetConnect VSS -type pgpin -pin VSS -instanceBasename * -verbose

addRing \
  -nets {VDD VSS} \
  -type core_rings \
  -follow io \
  -layer {top Metal11 bottom Metal11 left Metal10 right Metal10} \
  -width {top 1.8 bottom 1.8 left 1.8 right 1.8} \
  -spacing {top 1.8 bottom 1.8 left 1.8 right 1.8} \
  -offset {top 1.8 bottom 1.8 left 1.8 right 1.8} \
  -center 0 \
  -threshold 0 \
  -jog_distance 0 \
  -snap_wire_center_to_grid None

addStripe \
  -nets {VDD VSS} \
  -layer Metal11 \
  -direction horizontal \
  -width 0.9 \
  -spacing 1.25 \
  -set_to_set_distance 40 \
  -start_from bottom \
  -switch_layer_over_obs false \
  -max_same_layer_jog_length 2 \
  -padcore_ring_top_layer_limit Metal11 \
  -padcore_ring_bottom_layer_limit Metal1 \
  -block_ring_top_layer_limit Metal11 \
  -block_ring_bottom_layer_limit Metal1 \
  -use_wire_group 0 \
  -snap_wire_center_to_grid None


addStripe \
  -nets {VDD VSS} \
  -layer Metal10 \
  -direction vertical \
  -width 0.9 \
  -spacing 1.25 \
  -set_to_set_distance 50 \
  -start_from bottom \
  -switch_layer_over_obs false \
  -max_same_layer_jog_length 2 \
  -padcore_ring_top_layer_limit Metal10 \
  -padcore_ring_bottom_layer_limit Metal1 \
  -block_ring_top_layer_limit Metal10 \
  -block_ring_bottom_layer_limit Metal1 \
  -use_wire_group 0 \
  -snap_wire_center_to_grid None



setDesignMode -topRoutingLayer 11
setDesignMode -bottomRoutingLayer 2

snapFPlan -guide -block -stdCell -ioPad -pin -pinGuide -routeBlk -pinBlk -ptnCore -placeBlk -macroPin
setDrawView fplan
fit

sroute

# check_design -all
# gui_fit